// -------------------------------------------------------------------------------------------------------------------------------------
//Задача 20.Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между
//ними в 2D пространстве.
//--------------------------------------------------------------------------------------------------------------------------------------

// Чтение данных из консоли
int ReadData(string line)
{
    //Выводим число
    Console.WriteLine(line);
    //Считываем число
    int number = int.Parse(Console.ReadLine() ?? "0"); // ??"0" - если пользователь ничего не введет, то программа выдаст пустое значение
    //Возвращаем значение
    return number;
}

// Расстояние между двумя точками
double CalData(int x1, int y1, int x2, int y2)
{
return Math.Sqrt((x2-x1)*(x2-x1)+ (y2-y1)*(y2-y1));

//return Math.Sqrt(Math.Pow((x2-x1),2) + Math.Pow((y2-y1),2));  

}

//Выводим результат
void PrintResult(string line)
{
    Console.WriteLine(line);
}

//Собираем данные
int x1 = ReadData("Введите x1: ");
int y1 = ReadData("Введите y1: ");
int x2 = ReadData("Введите x2: ");
int y2 = ReadData("Введите y2: ");

//Выводим результат
PrintResult(Math.Round(CalData(x1,y1,x2,y2),2).ToString());//Math.Round(result,2)-округление до 2 элементов

