// -------------------------------------------------------------------------------------------------------------------------------------
//Задача 14.Напишите программу,которая принимает на вход число и проверяет
//кратно ли оно одновременно 7 и 23.
//--------------------------------------------------------------------------------------------------------------------------------------

// Вариант1

// Console.Write("Введите число: ");
// string? inputLineA = Console.ReadLine();

// int inputNumberA = int.Parse(inputLineA);

// if (inputNumberA % 7 == 0 && inputNumberA % 23 == 0)
// {
//     Console.WriteLine("Число кратно одновременно 7 и 23");
// }
// else
// {
//     Console.WriteLine("Число не кратно одновременно 7 и 23");
// }

// Вариант2
string? inputLineA = Console.ReadLine();
if (inputLineA != null)
    Console.WriteLine(((int.Parse(inputLineA) % 7 == 0) && (int.Parse(inputLineA) % 23 == 0)) ? ("Число кратно одновременно 7 и 23") : ("Число не кратно одновременно 7 и 23"));

